<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  <meta name="description" content="pilares de la web">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>Los tres pilares de la Web</title>
</head>
<body>
<h1>Los tres pilares de la Web</h1>
<p>
  <a href="http://es.wikipedia.org/wiki/Tim_Berners-Lee">
    Tim Berners-Lee</a>
    es considerado el padre de la Web porque desarroll&aacute; los tres elementos b&aacute;sicos para el funcionamiento de la
    <a href="http://es.wikipedia.org/wiki/World_Wide_Web">Web</a>:
</p>

<ul>
  <li><a href="#html">HTML</a></li>
  <li><a href="#http">HTTP</a></li>
  <li><a href="#url">URL</a></li>
</ul>

<h2 id="html">HTML</h2>
<p>
  HTML, siglas de <strong>HyperText Markup Language</strong>,
  hace referencia al <span style="color:red" >lenguaje</span>
 de marcado para la elaboraci&oacute;n de p&aacute;ginas web.
  Es un est&aacute;ndar que sirve de referencia para la elaboraci&oacute;n de p&aacute;ginas web
  en sus diferentes versiones, define una estructura b&aacute;sica y un c&oacute;digo (denominado c&oacute;digo HTML)
  para la definici&oacute;n de contenido de una p&aacute;gina web, como texto, im&aacute;genes, entre otros.
  Es un est&aacute;ndar a cargo de la W3C, organizaci&oacute;n dedicada a la estandarizaci&oacute;n de casi todas
  las tecnologías ligadas a la web, sobre todo en lo referente a su escritura e interpretaci&oacute;n.
  Es el lenguaje con el que se definen las p&aacute;ginas web.
</p>

<p>
Fuente: <a href="http://es.wikipedia.org/wiki/HTML">HTML</a>, Wikipedia
</p>

<h2 id="http">HTTP</h2>
<p>
  <strong>Hypertext Transfer Protocol</strong> o HTTP (en español protocolo de transferencia de hipertexto)
  es el protocolo usado en cada transacci&oacute;n de la World Wide Web.
  HTTP fue desarrollado por el World Wide Web Consortium y la Internet Engineering Task Force,
  colaboraci&oacute;n que culmin&oacute; en 1999 con la publicaci&oacute;n de una serie de RFC,
  el m&aacute;s importante de ellos es el RFC 2616 que especifica la versi&oacute;n 1.1.
</p>

<p>
Fuente: <a href="http://es.wikipedia.org/wiki/Hypertext_Transfer_Protocol">HTTP</a>, Wikipedia
</p>

<h2 id="url">URL</h2>
<p>
Un <strong>localizador de recursos uniforme</strong> o URL —siglas en ingl&eacute;s de <em>Uniform Resource Locator</em>—
es un identificador de recursos uniforme (URI) cuyos recursos referidos pueden cambiar, esto es, la direcci&oacute;n puede
apuntar a recursos variables en el tiempo. Est&aacte;n formados por una secuencia de caracteres, de acuerdo a un formato
 m&oacute;délico y est&aacute;ndar, que designa recursos en una red, como Internet.
</p>

<p>
    Fuente: <a href="http://es.wikipedia.org/wiki/Localizador_de_recursos_uniforme">URL</a>, Wikipedia
</p>

<address>
  Escrito por <a href="mailto:webmaster@example.com">Juan P&eacute;rez</a>.<br>
  Visitanos en:<br>
  www.itorizaba.edu.com<br>
  CP 94340, Col. Zapata<br>
  Orizaba, Veracruz, M&eacute;xico.
</address>

</body>
</html>
